title: SSH Brute Force Detection

id: 100300-ssh-bruteforce

status: experimental

description: Detects repeated failed SSH login attempts indicating possible brute force attacks.

author: Hiury Demuner

date: 2026-05-26

logsource:
  product: linux
  service: sshd

detection:
  selection:
    message|contains:
      - 'Failed password'

  condition: selection

fields:
  - src_ip
  - user
  - hostname

level: high

tags:
  - attack.credential_access
  - attack.t1110
  - attack.persistence
